-- 관심 분야 전체 삽입
INSERT INTO interests (interests_id, name) VALUES
                                               (1, '드로잉'),
                                               (2, '공예'),
                                               (3, '요리'),
                                               (4, '음악'),
                                               (5, '운동'),
                                               (6, '라이프스타일'),
                                               (7, '사진/영상'),
                                               (8, '금융/재테크'),
                                               (9, '창업/부업'),
                                               (10, '프로그래밍'),
                                               (11, '데이터사이언스'),
                                               (12, 'AI'),
                                               (13, '제2외국어'),
                                               (14, '뷰티'),
                                               (15, '테크/디지털'),
                                               (16, '심리/상담'),
                                               (17, '여행'),
                                               (18, '자기계발'),
                                               (19, '기타')
ON DUPLICATE KEY UPDATE interests_id = VALUES(interests_id);

-- 이미지 키워드 전체 삽입
INSERT INTO keywords (keywords_id, name) VALUES
                                             (1, '긍정적인'),
                                             (2, '열정적인'),
                                             (3, '책임있는'),
                                             (4, '따스한'),
                                             (5, '감정적인'),
                                             (6, '공감능력이 좋은'),
                                             (7, '창의적인'),
                                             (8, '도전적인'),
                                             (9, '헌신적인'),
                                             (10, '계산적인'),
                                             (11, '수학적인'),
                                             (12, '믿을만한'),
                                             (13, '애정있는'),
                                             (14, '소통하는'),
                                             (15, '결단력 있는'),
                                             (16, '소극적인'),
                                             (17, '외부 영향을 많이 받는')
ON DUPLICATE KEY UPDATE keywords_id = VALUES(keywords_id);